cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

# Fonts
cask 'font-scurcecodepro-nerd-font'
# Nerd fonts Source Code Pro version doesn't have italics so we install
# the official version
cask 'font-source-code-pro'

# Compiler related
brew 'gcc'
brew 'coreutils'

# Languages: Python3, node
brew 'python3'
brew 'pyenv'
brew 'node'

# Neovim and tmux
brew 'neovim'
brew 'tmux'

# Other useful tool
brew 'imgcat'
brew 'unrar'
brew 'the_silver_searcher'
brew 'fd'
brew 'ripgrep'
brew 'grc'
brew 'tmux-xpanes'
brew 'colordiff'
brew 'diff-so-fancy
brew 'ssh-copy-id'
brew 'highlight'
brew 'exa'
#brew 'findutils'
#brew 'git-flow'
brew 'mackup'
#brew 'trash'
#brew 'tree'

# Apps
#cask 'beyond-compare'
cast 'docker'
cast 'vlc'
cask 'iterm2'
cask 'typora'
cask 'hammerspoon'
cask 'keycastr'
# Databases
brew 'mongodb'
brew 'mysql'
brew 'redis'
