cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'mongodb/brew'


# Fonts
cask 'font-sourcecodepro-nerd-font'
# Nerd fonts Source Code Pro version doesn't have italics so we install
# the official version
cask 'font-source-code-pro'

# Compiler related
brew 'gcc'
brew 'coreutils'

# Languages: Python3, node
brew 'python3'
brew 'pyenv'
brew 'node'

# Neovim and tmux
brew 'neovim'
brew 'tmux'

# DevOps
brew 'ansible'

# Other useful tool
brew 'fzf'
brew 'eddieantonio/eddieantonio/imgcat'
brew 'unrar'
brew 'the_silver_searcher'
brew 'fd'
brew 'ripgrep'
brew 'grc'
brew 'tmux-xpanes'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'ssh-copy-id'
brew 'highlight'
brew 'exa'
#brew 'findutils'
#brew 'git-flow'
brew 'mackup'
#brew 'trash'
brew 'tree'
brew 'aria2'
brew 'packer'

# Apps
cask 'qingg'
cask 'shadowsocksx-ng'
cask 'beyond-compare'
cask 'google-chrome'
cask 'docker'
cask 'vlc'
cask 'iterm2'
cask 'typora'
cask 'hammerspoon'
cask 'keycastr'
cask 'miniconda'
cask 'karabiner-elements'
cask 'vagrant'
# Databases
brew 'mongodb-community'
brew 'mysql'
brew 'redis'
