cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'unrar'
# code searching tool `ag`
brew 'the_silver_searcher'
brew 'fd'
# fastest search tool
brew 'ripgrep'
# colourise
brew 'grc'
# terminal enhance
brew 'tmux'
brew 'tmux-xpanes'
brew 'colordiff'
brew 'diff-so-fancy
brew 'ssh-copy-id'
brew 'highlight'
brew 'exa'

#brew 'bash'
brew 'coreutils'
#brew 'findutils'
#brew 'git-flow'
brew 'mackup'
brew 'neovim'
#brew 'pyenv'
#brew 'trash'
#brew 'tree'
#cask 'beyond-compare'
cask 'iterm2'
cask 'font-sourcecodepro-nerd-font'
cask 'typora'
